In [1]:
 %load_ext sql

In [2]:
%sql sqlite://

'Connected: @None'

In [3]:
%%sql   
CREATE TABLE EMPLOYEE(firstname varchar(50),lastname varchar(50));  
INSERT INTO EMPLOYEE VALUES('Tom','Mitchell');  
INSERT INTO EMPLOYEE VALUES('Jack','Ryan');

 * sqlite://
Done.
1 rows affected.
1 rows affected.

[]

In [4]:
 %sql SELECT * from EMPLOYEE;

 * sqlite://
Done.

[('Tom', 'Mitchell'), ('Jack', 'Ryan')]

In [11]:
%%sql   

CREATE TABLE worker ( WORKER_ID INT NOT NULL PRIMARY KEY, FIRST_NAME CHAR(25), LAST_NAME CHAR(25), SALARY INT(15), JOINING_DATE DATETIME, DEPARTMENT CHAR(25) );

 * sqlite://
Done.

[]

In [12]:
 %sql INSERT INTO worker (WORKER_ID, FIRST_NAME, LAST_NAME, SALARY, JOINING_DATE, DEPARTMENT) VALUES (001, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'), (002, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'), (003, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'), (004, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'), (005, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'), (006, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'), (007, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'), (008, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin');

 * sqlite://
8 rows affected.

[]

In [13]:
%sql select * from worker

 * sqlite://
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin')]

In [14]:
%%sql

CREATE TABLE Bonus ( WORKER_REF_ID INT, BONUS_AMOUNT INT(10), BONUS_DATE DATETIME, FOREIGN KEY (WORKER_REF_ID) REFERENCES Worker(WORKER_ID) ON DELETE CASCADE );

 * sqlite://
Done.

[]

In [15]:
%sql INSERT INTO Bonus (WORKER_REF_ID, BONUS_AMOUNT, BONUS_DATE) VALUES (001, 5000, '16-02-20'), (002, 3000, '16-06-11'), (003, 4000, '16-02-20'), (001, 4500, '16-02-20'), (002, 3500, '16-06-11');

 * sqlite://
5 rows affected.

[]

In [16]:
%%sql
CREATE TABLE Title ( WORKER_REF_ID INT, WORKER_TITLE CHAR(25), AFFECTED_FROM DATETIME, FOREIGN KEY (WORKER_REF_ID) REFERENCES Worker(WORKER_ID) ON DELETE CASCADE );

 * sqlite://
Done.

[]

In [17]:
%%sql
INSERT INTO Title (WORKER_REF_ID, WORKER_TITLE, AFFECTED_FROM) VALUES (001, 'Manager', '2016-02-20 00:00:00'), (002, 'Executive', '2016-06-11 00:00:00'), (008, 'Executive', '2016-06-11 00:00:00'), (005, 'Manager', '2016-06-11 00:00:00'), (004, 'Asst. Manager', '2016-06-11 00:00:00'), (007, 'Executive', '2016-06-11 00:00:00'), (006, 'Lead', '2016-06-11 00:00:00'), (003, 'Lead', '2016-06-11 00:00:00');

 * sqlite://
8 rows affected.

[]

###  Q-10. Write An SQL Query To Print The FIRST_NAME And LAST_NAME From Worker Table Into A Single Column COMPLETE_NAME. A Space Char Should Separate Them.

In [22]:
%sql select first_name || ' ' || last_name as COMPLETER_NAME from worker;

 * sqlite://
Done.

[('Monika Arora',),
 ('Niharika Verma',),
 ('Vishal Singhal',),
 ('Amitabh Singh',),
 ('Vivek Bhati',),
 ('Vipul Diwan',),
 ('Satish Kumar',),
 ('Geetika Chauhan',)]

### Q-11. Write An SQL Query To Print All Worker Details From The Worker Table Order By FIRST_NAME Ascending.

In [24]:
%sql select * from worker order by first_name

 * sqlite://
Done.

[(4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin'),
 (1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin')]

### Q-12. Write An SQL Query To Print All Worker Details From The Worker Table Order By FIRST_NAME Ascending And DEPARTMENT Descending.

In [26]:
%sql select * from worker order by first_name asc, department desc

 * sqlite://
Done.

[(4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin'),
 (1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
 (6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin')]

###  Q-13. Write An SQL Query To Print Details For Workers With The First Name As “Vipul” And “Satish” From Worker Table.

In [27]:
%sql select * from worker where first_name in ('Vipul', 'Satish')

 * sqlite://
Done.

[(6, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account')]

### Q-14. Write An SQL Query To Print Details Of Workers Excluding First Names, “Vipul” And “Satish” From Worker Table.

In [31]:
%sql select * from worker where first_name not in ('Vipul', 'Satish');

 * sqlite://
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin')]

### Q-15. Write An SQL Query To Print Details Of Workers With DEPARTMENT Name As “Admin”.

In [33]:
%sql select * from worker where department like 'Admin%'

 * sqlite://
Done.

[(2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (5, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin')]

### Q-16. Write An SQL Query To Print Details Of The Workers Whose FIRST_NAME Contains ‘A’.

In [35]:
%sql select * from worker where first_name like '%A%'

 * sqlite://
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (3, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'),
 (4, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'),
 (7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin')]

### Q-17. Write An SQL Query To Print Details Of The Workers Whose FIRST_NAME Ends With ‘A’.

In [39]:
%sql select * from worker where first_name like '%a'

 * sqlite://
Done.

[(1, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'),
 (2, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'),
 (8, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin')]

### Q-18. Write An SQL Query To Print Details Of The Workers Whose FIRST_NAME Ends With ‘H’ And Contains Six Alphabets.

In [42]:
%sql select * from worker where first_name like '_____h' 
#and length(first_name) = 6

 * sqlite://
Done.

[(7, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account')]

### Q-19. Write An SQL Query To Print Details Of The Workers Whose SALARY Lies Between 100000 And 500000.

In [43]:
%sql

 * sqlite://

'Connected: @None'

In [45]:
%sql Select * from Worker where year(JOINING_DATE) = 2014 and month(JOINING_DATE) = 2;

 * sqlite://
(sqlite3.OperationalError) no such function: year [SQL: 'Select * from Worker where year(JOINING_DATE) = 2014 and month(JOINING_DATE) = 2;'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [50]:
def number(height):
    n = len(height)
    count=0
    for i in range(n):
        k = i
        while(height[i] > height[k-1] and k < n):
            count = count + 1
            k = k+1
    return count

In [65]:
number([1,1,4,1,3,5,2])

3

In [74]:
a,b = [1,2]
a

1

In [62]:
for i in range(len(a)):
    print(a[i])

1
1
0
3

In [80]:
len([['B'], ['B', 'A'], ['B', 'A', 'N'], ['B', 'A', 'N', 'A'], ['B', 'A', 'N', 'A', 'N'], ['B', 'A', 'N', 'A', 'N', 'A'], ['N'], ['N', 'A'], ['N', 'A', 'N'], ['N', 'A', 'N', 'A'], ['N'], ['N', 'A']])

12

In [79]:
a.append(3)

In [81]:
a[0:3]

[1, 2, 2]

In [82]:
a

[1, 2, 2, 3, 3]

In [83]:
a[3:]

[3, 3]

In [84]:
a= [1,2]

In [85]:
b=[]
b.append(a)
b

[[1, 2]]

In [86]:
a=[3,4]

In [87]:
b.append(a)
b

[[1, 2], [3, 4]]

In [88]:
b[1]

[3, 4]

In [92]:
c = [['pankaj'],['kumar']]

In [90]:
c.remove(c[1])

In [91]:
c

[['pankaj']]

In [93]:
c

[['pankaj'], ['kumar']]

In [94]:
c.append(['chandravanshi'])

In [95]:
c

[['pankaj'], ['kumar'], ['chandravanshi']]

In [96]:
l = []
l.append(1)

In [99]:
l.append(3)

In [100]:
l

[1, 3]

In [101]:
c.remove(l)

ValueError: list.remove(x): x not in list

In [102]:
l=[]

In [103]:
l

[]

In [104]:
b

[[1, 2], [3, 4]]

In [105]:
for k in l:
    b.remove(k)

In [106]:
b

[[1, 2], [3, 4]]

In [119]:
word_dict = {}

word_dict['pankaj'] =1

In [120]:
word_dict

{'pankaj': 1}

In [121]:
'pankaj' in word_dict

True

In [122]:
for word in word_dict:
    print(word)

pankaj

In [125]:
word_dict['kumar'] =2

In [127]:
word_dict.keys()

dict_keys(['pankaj', 'kumar'])

In [129]:
g = [[] for i in range(3)]

In [142]:
g[0].append(1)
g[0]

[1, 1]

In [143]:
for i in g[0]:
    print(i,'pals')

1 pals
1 pals

In [144]:
'pankaj_Kumar'.replace('_',' ')

'pankaj Kumar'

In [148]:
a= [1,2,0,3,4,5]
l = a.index(min(a))

2

In [152]:
left = a[:2]
sorted(left, reverse=True)

[2, 1]

In [155]:
from collections import deque
d = deque(a)

In [156]:
d

deque([1, 2, 0, 3, 4, 5])

In [157]:
d.pop()

5

In [158]:
d

deque([1, 2, 0, 3, 4])

In [159]:
d.popleft()

1

In [172]:
a = int(''.join(['2']*2))

In [175]:
[2]*2

[2, 2]

In [177]:
from collections import Counter

a = Counter([1,1,2,3])

In [182]:
a[2]
a = set((1,2,3))

In [183]:
a

{1, 2, 3}

In [184]:
b = set((1,5,6))
b

{1, 5, 6}

In [189]:
card = '123-145-25'

In [202]:
a = Counter(card)

In [203]:
a

Counter({'1': 2, '2': 2, '3': 1, '-': 2, '4': 1, '5': 3})

In [201]:
a

{'-', '1', '2', '3', '4', '5'}

In [187]:
card.index('-')

3

In [188]:
list(1)

TypeError: 'int' object is not iterable

In [204]:
a = 9

In [205]:
++a

9

In [206]:
--a

9

In [207]:
a++

SyntaxError: invalid syntax (<ipython-input-207-22e3d6dc1353>, line 1)

In [208]:
a+

SyntaxError: invalid syntax (<ipython-input-208-d589f663f6c7>, line 1)

In [253]:
a = [1,1,2,3]

In [254]:
for i in range(len(a)):
    num = a[:]
    del num[i]
    print(num,a)

[1, 2, 3] [1, 1, 2, 3]
[1, 2, 3] [1, 1, 2, 3]
[1, 1, 3] [1, 1, 2, 3]
[1, 1, 2] [1, 1, 2, 3]

In [247]:
d = a

In [248]:
d

[1, 1, 2, 3]

In [251]:
d.remove(d[1])

In [252]:
a

[1, 3]

In [255]:
pow(2,3)

8

In [260]:
import math

In [261]:
math.e

2.718281828459045